{
  "content": [
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "Introduction",
          "bold": true,
          "underline": true
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "bold": true,
          "underline": true,
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": "This digital humanities project aims to serve as an accessible and engaging introduction to the work of several influential filmmakers from around the globe. Recognizing that the definition of \"greatness\" in cinema is subjective, this initial selection represents a personal curation intended to spark curiosity and further exploration. The project encompasses a diverse array of resources designed to provide a multifaceted understanding of each filmmaker's contribution. Users will find insightful film reviews offering critical analyses of key works, transcribed interviews providing direct access to the filmmakers' thoughts and creative processes, and where possible, links to the films themselves for immediate viewing. Furthermore, the project anticipates expanding beyond these core materials to potentially include scholarly essays, behind-the-scenes footage, and comparative analyses of different directors. The initial selection of filmmakers features individuals from countries such as the United States, Cuba, Japan, Russia, India, and many more, reflecting a commitment to showcasing a broad spectrum of cinematic voices and cultural perspectives. This international scope underscores the project's aim to move beyond conventional Western-centric narratives in film history. A key aspiration of this project is to foster a collaborative environment. To this end, the platform is designed to allow users to contribute their own pages dedicated to filmmakers they believe warrant inclusion in this symposium. This open and participatory structure encourages a dynamic and evolving resource, reflecting the diverse and ever-expanding landscape of global cinema. By providing a foundation of carefully selected filmmakers and offering the opportunity for community contribution, this project seeks to cultivate a deeper appreciation for the art of filmmaking and inspire further independent discovery."
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "image",
      "url": "https://lwlies.com/wp-content/uploads/2016/05/stalker-andrei-tarkovsky.jpg",
      "caption": "Stalker - Andrei Tarkosvky",
      "children": [
        {
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "textSize": "heading-one",
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "textSize": "heading-one",
          "text": "Interested in writing about another global filmmaker? "
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "textSize": "heading-one",
          "text": "Contact me: jriordan@utexas.edu"
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "textSize": "heading-one",
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "textSize": "heading-one",
          "text": ""
        }
      ]
    },
    {
      "type": "paragraph",
      "children": [
        {
          "text": ""
        }
      ]
    }
  ],
  "created_at": "2025-05-29T17:40:13.397Z",
  "created_by": "jackDeVry",
  "title": "A Symposium of Global Filmmakers",
  "updated_at": "2025-06-05T18:59:25.366Z",
  "updated_by": "jackDeVry",
  "autogenerate": {
    "enabled": false,
    "type": "home"
  }
}